# Creation of series

In [1]:
import pandas as pd
import numpy as np

In [7]:
a = ['*****10000*****','*****200000****','*****30000*****']
s= pd.Series(a,index = [1,2,3])
print(s.str.rstrip('*'))
print(s.str.lstrip('*'))

1     *****10000
2    *****200000
3     *****30000
dtype: object
1    10000*****
2    200000****
3    30000*****
dtype: object

In [2]:
arr = np.array([i for i in range(1,60+1) if i % 6 == 0])
print(f"numpy array :{arr}")
dt = pd.Series(arr)
print(f"Converted pandas series : \n{dt}")

numpy array :[ 6 12 18 24 30 36 42 48 54 60]
Converted pandas series :
0     6
1    12
2    18
3    24
4    30
5    36
6    42
7    48
8    54
9    60
dtype: int32

In [3]:
dst = {'name':'vishu','RollNo':1056,'section':'C'}
ds = pd.Series(dst)
print(ds)

name       vishu
RollNo      1056
section        C
dtype: object

In [4]:
n =int(input("enter an integer value:"))
lst = [i for i in range(10,n+1,10)]
data = pd.Series(lst)
data

enter an integer value:4

Series([], dtype: object)

In [5]:
def dataseries(l):
    ds = pd.Series(l)
    return ds
l = [1,2,3,43,4,5,6]
print(dataseries(l))

0     1
1     2
2     3
3    43
4     4
5     5
6     6
dtype: int64

In [6]:
m = int(input("Enter a number"))
lst1 = [i for i in range (1,m) if i % 6 == 0 ]
lst2 = [i for i in range (1,m) if i % 7 == 0 ]
print(lst1)
print(lst2)
dataseries = pd.Series(lst1) 
dataseries1 = pd.Series(lst2)
add = dataseries+dataseries1
sub = dataseries-dataseries1
mul = dataseries*dataseries1
div = dataseries/dataseries1
print(add)
print(sub)
print(mul)
print(div)

Enter a number30
[6, 12, 18, 24]
[7, 14, 21, 28]
0    13
1    26
2    39
3    52
dtype: int64
0   -1
1   -2
2   -3
3   -4
dtype: int64
0     42
1    168
2    378
3    672
dtype: int64
0    0.857143
1    0.857143
2    0.857143
3    0.857143
dtype: float64

# Creation of Data Frame.

In [4]:
import pandas as pd
import numpy as np

In [30]:
data = {"name":["Santha",'Kumari','kumar','Krishna'], 
        'Subject':['DBMS','FLAT','CNS','JAVA'],
        'Periods':[1,4,2,5]
       }
df = pd.DataFrame(data)
df

      name Subject  Periods
0   Santha    DBMS        1
1   Kumari    FLAT        4
2    kumar     CNS        2
3  Krishna    JAVA        5

#  Replacing the column name with another column name

In [31]:
df['name'] = df['name'].replace('Krishna','Sudeep')
df['name'] = df['name'].replace('kumar','Ram')
df

     name Subject  Periods
0  Santha    DBMS        1
1  Kumari    FLAT        4
2     Ram     CNS        2
3  Sudeep    JAVA        5

# Inserting a new column into the dataframe
## while introducing the new column the shape of thr column and shape of the dataframe should  be equal

In [36]:
classes = ['II','II','III','II']
df['CLASS'] = classes
sections = ['CSE_C','CSE_A','AI&DS','CSE_B']
df['SECTIONS']= sections
d=df
d

     name Subject  Periods CLASS SECTIONS
0  Santha    DBMS        1    II    CSE_C
1  Kumari    FLAT        4    II    CSE_A
2     Ram     CNS        2   III    AI&DS
3  Sudeep    JAVA        5    II    CSE_B

In [ ]:
m = df["java"] <= 40

In [38]:
print(d.iloc[0])

name        Santha
Subject       DBMS
Periods          1
CLASS           II
SECTIONS     CSE_C
Name: 0, dtype: object

In [41]:
d.iloc[[i for i in range(0,3+1) if i % 2==0]]

     name Subject  Periods CLASS SECTIONS
0  Santha    DBMS        1    II    CSE_C
2     Ram     CNS        2   III    AI&DS

# Masking

In [14]:
DataFrame = {'Eno':[501,502,503,504,505,506,507,508,509],
             'Ename':['Hima','Rani','Mahi','Dhoni','Lokesh','Chaitu','Madhuri','Vyshnavi','Zubair'],
             'Job':['Clerk','Salesman','Develper','Analyst','Salesman','Clerk','clerk','Manager','Developer'],
             'sal':[1000,2500,4000,5000,4500,3500,1500,6000,1500],
             'dept': [20,30,10,20,30,10,10,20,30]
            }

In [15]:
frm = pd.DataFrame(DataFrame)
frm

   Eno     Ename        Job   sal  dept
0  501      Hima      Clerk  1000    20
1  502      Rani   Salesman  2500    30
2  503      Mahi   Develper  4000    10
3  504     Dhoni    Analyst  5000    20
4  505    Lokesh   Salesman  4500    30
5  506    Chaitu      Clerk  3500    10
6  507   Madhuri      clerk  1500    10
7  508  Vyshnavi    Manager  6000    20
8  509    Zubair  Developer  1500    30

In [16]:
ms = frm['sal'].max()
m = frm ['Job'] == 'Salesman'
frm[ms & m]

Empty DataFrame
Columns: [Eno, Ename, Job, sal, dept]
Index: []

In [17]:
# # Display all employees who are managers. 
# # Display all employees whose sal greater than or equal to 3500
#Mask = frm['sal']>=3500
#print(frm[Mask])
# # # Display all employees whose job equal to clerk and salary lessthan or equal to 1500
# mask = frm['Job']== 'Clerk'
# mask1 = frm['sal'] <= 1500
# frm[mask & mask1]
mask2 = frm['Job']== 'Manager'
frm[mask2]

   Eno     Ename      Job   sal  dept
7  508  Vyshnavi  Manager  6000    20

In [18]:


# Display all employees who belongs to 20th department and job is manager.
mas = frm['dept'] == 20
mas1 = frm ['Job'] == 'Manager'
frm[mas & mas1]

   Eno     Ename      Job   sal  dept
7  508  Vyshnavi  Manager  6000    20

In [19]:

# Display how many employees are present in the organization
frm.shape[0]

9

In [20]:

# Display the total pay of organization
m = frm ['sal'].sum()
# s = frm[m].sum()
m

29500

# Exercie_C

In [21]:
frm

   Eno     Ename        Job   sal  dept
0  501      Hima      Clerk  1000    20
1  502      Rani   Salesman  2500    30
2  503      Mahi   Develper  4000    10
3  504     Dhoni    Analyst  5000    20
4  505    Lokesh   Salesman  4500    30
5  506    Chaitu      Clerk  3500    10
6  507   Madhuri      clerk  1500    10
7  508  Vyshnavi    Manager  6000    20
8  509    Zubair  Developer  1500    30

In [22]:
l = ['a','b','c','e','f','g','h','i','j']
f= [1.1,2.2,3.3,4.4,5.5,6.6,7.7,8.8,9.9]
n = [1,2,3,4,5,6,7,8,9]
data = pd.DataFrame(DataFrame, index = n)
data

   Eno     Ename        Job   sal  dept
1  501      Hima      Clerk  1000    20
2  502      Rani   Salesman  2500    30
3  503      Mahi   Develper  4000    10
4  504     Dhoni    Analyst  5000    20
5  505    Lokesh   Salesman  4500    30
6  506    Chaitu      Clerk  3500    10
7  507   Madhuri      clerk  1500    10
8  508  Vyshnavi    Manager  6000    20
9  509    Zubair  Developer  1500    30

In [23]:
# data['length'] = list(map(lambda x: len(x),data['Ename']))
# data['length'].sum()
data['count'] = list(map(lambda y: y.count('a'),data['Job']))
data

   Eno     Ename        Job   sal  dept  count
1  501      Hima      Clerk  1000    20      0
2  502      Rani   Salesman  2500    30      2
3  503      Mahi   Develper  4000    10      0
4  504     Dhoni    Analyst  5000    20      1
5  505    Lokesh   Salesman  4500    30      2
6  506    Chaitu      Clerk  3500    10      0
7  507   Madhuri      clerk  1500    10      0
8  508  Vyshnavi    Manager  6000    20      2
9  509    Zubair  Developer  1500    30      0

In [24]:
d =data.Ename.str.upper()
d
a = data.Job.str.lower()
a
# data.Ename.str.rstrip()

print(data.Ename.str.swapcase())

1        hIMA
2        rANI
3        mAHI
4       dHONI
5      lOKESH
6      cHAITU
7     mADHURI
8    vYSHNAVI
9      zUBAIR
Name: Ename, dtype: object

In [25]:
a=data['Ename']
a

1        Hima
2        Rani
3        Mahi
4       Dhoni
5      Lokesh
6      Chaitu
7     Madhuri
8    Vyshnavi
9      Zubair
Name: Ename, dtype: object

In [8]:
Data = {'sno':[701,702,703,704,705,706,707,708,709],
       'sname':["R.Pranthi",'N.Hasani', 'A.Hima','Ch.Mothit','T.Jaswanth','T.Arun','P.Prabhas','K.Jyotshna','K.Vyshnavi'],
       'branch':['CSE','CS','MECH','CIVIL','EEE','CSE','AIML','ECE','IOT'],
       'address':['Ashok Nagar','R.R.Pet','SanthiNagar','Powerpet','Clock Tower','Fire Station','GV Mall centre','New Ashok Nagar','Hanuman Nagar'],
       }

In [9]:
fra = pd.DataFrame(Data,index=['a','b','c','d','e','f','g','h','i'])
fra['count'] = list(map(lambda y: y.count('A'),Data['branch']))
fra[['count','branch']]

   count branch
a      0    CSE
b      0     CS
c      0   MECH
d      0  CIVIL
e      0    EEE
f      0    CSE
g      1   AIML
h      0    ECE
i      0    IOT

In [26]:
lower = fra.sname.str.lower()
lower
print(fra.sname.str.swapcase())

a     r.pRANTHI
b      n.hASANI
c        a.hIMA
d     cH.mOTHIT
e    t.jASWANTH
f        t.aRUN
g     p.pRABHAS
h    k.jYOTSHNA
i    k.vYSHNAVI
Name: sname, dtype: object

In [27]:
fra['length'] = list(map(lambda x: len(x),fra['branch']))
b = fra.branch
l = fra.length
print(b,' ',"\n",l)

a      CSE
b       CS
c     MECH
d    CIVIL
e      EEE
f      CSE
g     AIML
h      ECE
i      IOT
Name: branch, dtype: object
 a    3
b    2
c    4
d    5
e    3
f    3
g    4
h    3
i    3
Name: length, dtype: int64

In [28]:
fra.address.str.strip
fra

   sno       sname branch          address  length
a  701   R.Pranthi    CSE      Ashok Nagar       3
b  702    N.Hasani     CS          R.R.Pet       2
c  703      A.Hima   MECH      SanthiNagar       4
d  704   Ch.Mothit  CIVIL         Powerpet       5
e  705  T.Jaswanth    EEE      Clock Tower       3
f  706      T.Arun    CSE     Fire Station       3
g  707   P.Prabhas   AIML   GV Mall centre       4
h  708  K.Jyotshna    ECE  New Ashok Nagar       3
i  709  K.Vyshnavi    IOT    Hanuman Nagar       3

In [11]:
# fra.plot(kind='pie')

ValueError: pie requires either y column or 'subplots=True'

In [6]:
''' Joining two dataframes'''
d = {'name':['Zoro','Luffy','Nami'],
    'branch':['CSE','MECH','MBA']}
df = pd.DataFrame(d)
df

    name branch
0   Zoro    CSE
1  Luffy   MECH
2   Nami    MBA

In [3]:
d2 = {'name':['Dragon','New Gate','Roger'],
    'branch':['CIVIL','CS','MBA']}
df1 = pd.DataFrame(d2)
display(df1)

       name branch
0    Dragon  CIVIL
1  New Gate     CS
2     Roger    MBA

In [14]:
import numpy as np
d = {'section':['a','b','c']}
df3 = pd.DataFrame(d)
pd.concat([df1,df3],index = False)

TypeError: concat() got an unexpected keyword argument 'index'

In [7]:
c = pd.concat([df,df1])
c

       name branch
0      Zoro    CSE
1     Luffy   MECH
2      Nami    MBA
0    Dragon  CIVIL
1  New Gate     CS
2     Roger    MBA

In [28]:
m1 =pd.merge(df,df1,on='name', how= 'outer') 
# m =pd.merge(df,df1,on='sname', how= 'outer')
m1

       name branch_x branch_y
0      Zoro      CSE      NaN
1     Luffy     MECH      NaN
2      Nami      MBA      NaN
3    Dragon      NaN    CIVIL
4  New Gate      NaN       CS
5     Roger      NaN      MBA

In [32]:
from datetime import datetime as d
print(d(2021,7,23).date())

2021-07-23

In [29]:
## Exercise-G
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
ds = {'sid':['s1','s2','s3','s4','s5','s6'],
     'school':['s001','s002','s003','s001','s002','s004'],
     'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes','Eesha Hinton','Gino Mcneill','David Parkes'],
     'date_Of_Birth':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','11/05/2002'],
      'age':[12,12,13,13,14,12],
      'height':[173,192,186,167,151,159],
      'weight':[35,32,33,30,31,32],
      'address':['street1','street2','street3','street1','street2','street4']
     }
dataset = pd.DataFrame(ds)
dataset
print(dataset.groupby(['school']))
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
print(type(dataset.groupby(['school'])))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000029154A6AD10>

Group:
('s001',)
  sid school             name date_Of_Birth  age  height  weight  address
0  s1   s001  A,lberto Franco    15/05/2002   12     173      35  street1
3  s4   s001     Eesha Hinton    25/09/1998   13     167      30  street1

Group:
('s002',)
  sid school          name date_Of_Birth  age  height  weight  address
1  s2   s002  Gino Mcneill    17/05/2002   12     192      32  street2
4  s5   s002  Gino Mcneill    11/05/2002   14     151      31  street2

Group:
('s003',)
  sid school         name date_Of_Birth  age  height  weight  address
2  s3   s003  Ryan Parkes    16/02/1999   13     186      33  street3

Group:
('s004',)
  sid school          name date_Of_Birth  age  height  weight  address
5  s6   s004  David Parkes    11/05/2002   12     159      32  street4
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>